cmsis-svd/cmsis-svd/data/Spansion/MB9BFD1xT_svd.xml
        <!-- REGISTER "I2C_FBYTE2" -->
        <register>
          <name>I2C_FBYTE2</name>
          <description>FIFO Byte Register 2</description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "MFS5" -->
    <peripheral derivedFrom="MFS4">
      <name>MFS5</name>
      <baseAddress>0x40038500</baseAddress>
      <!-- INTERRUPT "MFS5RX" -->
      <interrupt>
        <name>MFS5RX</name>
        <value>17</value>
      </interrupt>
      <!-- INTERRUPT "MFS5TX" -->
      <interrupt>
        <name>MFS5TX</name>
        <value>18</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS6" -->
    <peripheral derivedFrom="MFS4">
      <name>MFS6</name>
      <baseAddress>0x40038600</baseAddress>
      <!-- INTERRUPT "MFS6RX" -->
      <interrupt>
        <name>MFS6RX</name>
        <value>19</value>
      </interrupt>
      <!-- INTERRUPT "MFS6TX" -->
      <interrupt>
        <name>MFS6TX</name>
        <value>20</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS7" -->
    <peripheral derivedFrom="MFS4">
      <name>MFS7</name>
      <baseAddress>0x40038700</baseAddress>
      <!-- INTERRUPT "MFS7RX" -->
      <interrupt>
        <name>MFS7RX</name>
        <value>21</value>
      </interrupt>
      <!-- INTERRUPT "MFS7TX" -->
      <interrupt>
        <name>MFS7TX</name>
        <value>22</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS_NFC" -->
    <peripheral>
      <name>MFS_NFC</name>
      <description>I2C Auxiliary Noise Filter Setting Register</description>
      <groupName>MFS_NFC</groupName>
      <baseAddress>0x40038800</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "I2CDNF" -->
        <register>
          <name>I2CDNF</name>
          <description>I2C Auxiliary Noise Filter Setting Register</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "I2CDNF7" -->
            <field>
              <name>I2CDNF7</name>
              <description>Auxiliary noise filter additional step select bits for I2C ch.7</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2CDNF6" -->
            <field>
              <name>I2CDNF6</name>
              <description>Auxiliary noise filter additional step select bits for I2C ch.6</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2CDNF5" -->
            <field>
              <name>I2CDNF5</name>
              <description>Auxiliary noise filter additional step select bits for I2C ch.5</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2CDNF4" -->
            <field>
              <name>I2CDNF4</name>
              <description>Auxiliary noise filter additional step select bits for I2C ch.4</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2CDNF3" -->
            <field>
              <name>I2CDNF3</name>
              <description>Auxiliary noise filter additional step select bits for I2C ch.3</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2CDNF2" -->
            <field>
              <name>I2CDNF2</name>
              <description>Auxiliary noise filter additional step select bits for I2C ch.2</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2CDNF1" -->
            <field>
              <name>I2CDNF1</name>
              <description>Auxiliary noise filter additional step select bits for I2C ch.1</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2CDNF0" -->
            <field>
              <name>I2CDNF0</name>
              <description>Auxiliary noise filter additional step select bits for I2C ch.0</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "CRC" -->
    <peripheral>
      <name>CRC</name>
      <description>CRC Registers</description>
      <groupName>CRC</groupName>
      <baseAddress>0x40039000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "CRCCR" -->
        <register>
          <name>CRCCR</name>
          <description>CRC Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FXOR" -->
            <field>
              <name>FXOR</name>
              <description>Initialization bit</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRCLSF" -->
            <field>
              <name>CRCLSF</name>
              <description>Final XOR control bit</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRCLTE" -->
            <field>
              <name>CRCLTE</name>
              <description>CRC result bit-order setting bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LSBFST" -->
            <field>
              <name>LSBFST</name>
              <description>CRC result byte-order setting bit </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LTLEND" -->
            <field>
              <name>LTLEND</name>
              <description>Bit-order setting bit </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRC32" -->
            <field>
              <name>CRC32</name>
              <description>Byte-order setting bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INIT" -->
            <field>
              <name>INIT</name>
              <description>CRC mode selection bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CRCINIT" -->
        <register>
          <name>CRCINIT</name>
          <description>Initial Value Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "D" -->
            <field>
              <name>D</name>
              <description>Initial value</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CRCIN" -->
        <register>
          <name>CRCIN</name>
          <description>Input Data Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "D" -->
            <field>
              <name>D</name>
              <description>Input data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CRCR" -->
        <register>
          <name>CRCR</name>
          <description>CRC Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "D" -->
            <field>
              <name>D</name>
              <description>CRC Data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
