cmsis-svd/cmsis-svd/data/Spansion/MB9BFD1xT_svd.xml
        <!-- REGISTER "INTR" -->
        <register>
          <name>INTR</name>
          <description>CAN Interrupt Register</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INTID" -->
            <field>
              <name>INTID</name>
              <description>Interrupt Code</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TESTR" -->
        <register>
          <name>TESTR</name>
          <description>CAN Test Register</description>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00F4</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RX" -->
            <field>
              <name>RX</name>
              <description>Rx pin monitor bit </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TX" -->
            <field>
              <name>TX</name>
              <description>TX pin control bit</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LBACK" -->
            <field>
              <name>LBACK</name>
              <description>Loop back mode </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SILENT" -->
            <field>
              <name>SILENT</name>
              <description>Silent mode </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BASIC" -->
            <field>
              <name>BASIC</name>
              <description>Basic mode </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "BRPER" -->
        <register>
          <name>BRPER</name>
          <description>CAN Prescaler Extension Register</description>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BRPE" -->
            <field>
              <name>BRPE</name>
              <description>Baud rate prescaler extension bit</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1CREQ" -->
        <register>
          <name>IF1CREQ</name>
          <description>IF1 Command Request Register</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0001</resetValue>
          <resetMask>0x80FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BUSY" -->
            <field>
              <name>BUSY</name>
              <description>Busy flag bit </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MESSAGENUMBER" -->
            <field>
              <name>MESSAGENUMBER</name>
              <description>Message number</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1CMSK" -->
        <register>
          <name>IF1CMSK</name>
          <description>IF1 Command Mask Register</description>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WRRD" -->
            <field>
              <name>WRRD</name>
              <description>Writing or reading control bit </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description>Mask data update bit </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ARB" -->
            <field>
              <name>ARB</name>
              <description>Arbitration data update bit </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CONTROL" -->
            <field>
              <name>CONTROL</name>
              <description>Control data update bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CIP" -->
            <field>
              <name>CIP</name>
              <description>Interrupt clear bit </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NEWDAT" -->
            <field>
              <name>NEWDAT</name>
              <description>Message transmission request bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATAA" -->
            <field>
              <name>DATAA</name>
              <description>Data 0-3 update bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATAB" -->
            <field>
              <name>DATAB</name>
              <description>Data 4-7 update bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
