cmsis-svd/cmsis-svd/data/Spansion/MB9BFD1xT_svd.xml
        <!-- REGISTER "MAR1H" -->
        <register>
          <name>MAR1H</name>
          <description>MAC Address1 Register -High</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0xFF00FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AE" -->
            <field>
              <name>AE</name>
              <description>Address Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SA" -->
            <field>
              <name>SA</name>
              <description>Source Address</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MBC" -->
            <field>
              <name>MBC</name>
              <description>Mask Byte Control</description>
              <lsb>24</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A47" -->
            <field>
              <name>A47</name>
              <description>AD[47]</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A46" -->
            <field>
              <name>A46</name>
              <description>AD[46]</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A45" -->
            <field>
              <name>A45</name>
              <description>AD[45]</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A44" -->
            <field>
              <name>A44</name>
              <description>AD[44]</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A43" -->
            <field>
              <name>A43</name>
              <description>AD[43]</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A42" -->
            <field>
              <name>A42</name>
              <description>AD[42]</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A41" -->
            <field>
              <name>A41</name>
              <description>AD[41]</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A40" -->
            <field>
              <name>A40</name>
              <description>AD[40]</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A39" -->
            <field>
              <name>A39</name>
              <description>AD[39]</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A38" -->
            <field>
              <name>A38</name>
              <description>AD[38]</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A37" -->
            <field>
              <name>A37</name>
              <description>AD[37]</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A36" -->
            <field>
              <name>A36</name>
              <description>AD[36]</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A35" -->
            <field>
              <name>A35</name>
              <description>AD[35]</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A34" -->
            <field>
              <name>A34</name>
              <description>AD[34]</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A33" -->
            <field>
              <name>A33</name>
              <description>AD[33]</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A32" -->
            <field>
              <name>A32</name>
              <description>AD[32]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MAR1L" -->
        <register>
          <name>MAR1L</name>
          <description>MAC Address1 Register -Low</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "A31" -->
            <field>
              <name>A31</name>
              <description>AD[31]</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A30" -->
            <field>
              <name>A30</name>
              <description>AD[30]</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A29" -->
            <field>
              <name>A29</name>
              <description>AD[29]</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A28" -->
            <field>
              <name>A28</name>
              <description>AD[28]</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A27" -->
            <field>
              <name>A27</name>
              <description>AD[27]</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A26" -->
            <field>
              <name>A26</name>
              <description>AD[26]</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A25" -->
            <field>
              <name>A25</name>
              <description>AD[25]</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A24" -->
            <field>
              <name>A24</name>
              <description>AD[24]</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A23" -->
            <field>
              <name>A23</name>
              <description>AD[23]</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A22" -->
            <field>
              <name>A22</name>
              <description>AD[22]</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A21" -->
            <field>
              <name>A21</name>
              <description>AD[21]</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A20" -->
            <field>
              <name>A20</name>
              <description>AD[20]</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A19" -->
            <field>
              <name>A19</name>
              <description>AD[19]</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A18" -->
            <field>
              <name>A18</name>
              <description>AD[18]</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A17" -->
            <field>
              <name>A17</name>
              <description>AD[17]</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A16" -->
            <field>
              <name>A16</name>
              <description>AD[16]</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A15" -->
            <field>
              <name>A15</name>
              <description>AD[15]</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A14" -->
            <field>
              <name>A14</name>
              <description>AD[14]</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A13" -->
            <field>
              <name>A13</name>
              <description>AD[13]</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A12" -->
            <field>
              <name>A12</name>
              <description>AD[12]</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A11" -->
            <field>
              <name>A11</name>
              <description>AD[11]</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A10" -->
            <field>
              <name>A10</name>
              <description>AD[10]</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A9" -->
            <field>
              <name>A9</name>
              <description>AD[9]</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A8" -->
            <field>
              <name>A8</name>
              <description>AD[8]</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A7" -->
            <field>
              <name>A7</name>
              <description>AD[7]</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A6" -->
            <field>
              <name>A6</name>
              <description>AD[6]</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A5" -->
            <field>
              <name>A5</name>
              <description>AD[5]</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A4" -->
            <field>
              <name>A4</name>
              <description>AD[4]</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A3" -->
            <field>
              <name>A3</name>
              <description>AD[3]</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A2" -->
            <field>
              <name>A2</name>
              <description>AD[2]</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A1" -->
            <field>
              <name>A1</name>
              <description>AD[1]</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A0" -->
            <field>
              <name>A0</name>
              <description>AD[0]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MAR2H" -->
        <register derivedFrom="MAR1H">
          <name>MAR2H</name>
          <description>MAC Address2 Register -High</description>
          <addressOffset>0x50</addressOffset>
        </register>
        <!-- REGISTER "MAR2L" -->
        <register derivedFrom="MAR1L">
          <name>MAR2L</name>
          <description>MAC Address2 Register -Low</description>
          <addressOffset>0x54</addressOffset>
        </register>
        <!-- REGISTER "MAR3H" -->
        <register derivedFrom="MAR1H">
          <name>MAR3H</name>
          <description>MAC Address3 Register -High</description>
          <addressOffset>0x58</addressOffset>
        </register>
        <!-- REGISTER "MAR3L" -->
        <register derivedFrom="MAR1L">
          <name>MAR3L</name>
          <description>MAC Address3 Register -Low</description>
          <addressOffset>0x5C</addressOffset>
        </register>
        <!-- REGISTER "MAR4H" -->
        <register derivedFrom="MAR1H">
          <name>MAR4H</name>
          <description>MAC Address4 Register -High</description>
          <addressOffset>0x60</addressOffset>
        </register>
        <!-- REGISTER "MAR4L" -->
        <register derivedFrom="MAR1L">
          <name>MAR4L</name>
          <description>MAC Address4 Register -Low</description>
          <addressOffset>0x64</addressOffset>
        </register>
        <!-- REGISTER "MAR5H" -->
        <register derivedFrom="MAR1H">
          <name>MAR5H</name>
          <description>MAC Address5 Register -High</description>
          <addressOffset>0x68</addressOffset>
        </register>
        <!-- REGISTER "MAR5L" -->
        <register derivedFrom="MAR1L">
          <name>MAR5L</name>
          <description>MAC Address5 Register -Low</description>
          <addressOffset>0x6C</addressOffset>
        </register>
        <!-- REGISTER "MAR6H" -->
        <register derivedFrom="MAR1H">
          <name>MAR6H</name>
          <description>MAC Address6 Register -High</description>
          <addressOffset>0x70</addressOffset>
        </register>
